app/views/orders/_signed_person.html.erb

SELECT  "user_infos".* FROM "user_infos" WHERE "user_infos"."user_id" = $1 LIMIT $2  [["user_id", 14], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
    </div>
    <p class="list-item__name"><%= User.find(signed.signed_id).user_info.fio %></p>
    <div class="list-item__stars">
      <%= User.find(signed.signed_id).user_info.user_id %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
      <i class="far fa-clock"></i>
      <span><%= ((Time.now - User.find(signed.signed_id).created_at) / 86400).to_i %></span>