app/views/orders/show.html.erb

SELECT "signed_to_orders".* FROM "signed_to_orders" WHERE "signed_to_orders"."order_id" = $1  [["order_id", 5]]
---
<strong>Готовы работать:</strong>
<% @order.signed_to_orders.each do |signed| %>