app/controllers/messages_controller.rb

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("body", "user_id", "conversation_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Hi, there\r\n"], ["user_id", 2], ["conversation_id", 1], ["created_at", "2018-08-17 07:24:29.889832"], ["updated_at", "2018-08-17 07:24:29.889832"]]
---
  def create
    @conversation = Conversation.includes(:recipient).find(params[:conversation_id])
    @message = @conversation.messages.create(message_params)