app/controllers/orders_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2018-08-01 11:59:54.077950"], ["updated_at", "2018-08-01 11:59:54.077950"]]
INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 2], ["created_at", "2018-08-15 12:19:34.278986"], ["updated_at", "2018-08-15 12:19:34.278986"]]
---
  def create
    @user = User.find_by(id: current_user.id)
    @order = @user.orders.create(order_params)
    if @order.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 8]]
---
  def destroy
    @user = User.find(current_user)
    @order = user.orders.find(params[:id])
    @order.destroy

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def require_permission
    if current_user != Order.find(params[:id]).user_id