app/controllers/orders_controller.rb

  def index
    @orders = Order.all.where(chosed: nil)
---
SELECT "orders".* FROM "orders" WHERE "orders"."chosed" IS NULL