app/controllers/signed_to_orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "orders" SET "chosed" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["chosed", true], ["updated_at", "2018-08-15 16:28:05.527963"], ["id", 1]]
---
  def chosed
    @order = Order.find(params[:order_id])
    if @order.who != nil
      @order.update_attribute(:chosed, true)

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "orders" SET "who" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["who", 19], ["updated_at", "2018-08-15 16:27:57.262093"], ["id", 1]]
---
  def accept
    @order = Order.find(params[:order_id])
    @order.update_attribute(:who, params[:signed_id])

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "who" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["who", nil], ["updated_at", "2018-08-15 16:11:18.703000"], ["id", 1]]
---
  def dismiss
    @order = Order.find(params[:order_id])
    @order.update_attribute(:who, nil)

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "signed_to_orders" ("order_id", "signed_id", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["order_id", 5], ["signed_id", 2], ["price", 1000], ["created_at", "2018-08-16 12:47:01.581140"], ["updated_at", "2018-08-16 12:47:01.581140"]]
---
  def create
    @order = Order.find(params[:order_id])
    if @order.not_customer?(current_user)
      # @singin = @order.sign!(current_user)
      if @order.signed_to_orders.create(signed_params).save

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def destroy
    @order = Order.find(params[:order_id])

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def require_permission
    if current_user.id != Order.find(params[:id]).user_id