app/models/order.rb

DELETE FROM "signed_to_orders" WHERE "signed_to_orders"."id" = $1  [["id", 25]]
---
  def unsign!(other_user)
    signed_to_orders.find_by(signed_id: other_user.id).destroy!